Repository: arthurrios/swift-expense-split-api
Catalog: Sources/ExpenseSplitAPI/Resources/Localizable.xcstrings
Source language: en
Languages: pt_br

# errors.activity.forbidden
source: You can only view your own activities
pt_br: Você só pode visualizar suas próprias atividades

# errors.activity.notFound
source: Activity not found
pt_br: Atividade não encontrada

# errors.activity.notParticipant
source: You are not a participant of this activity
pt_br: Você não é participante desta atividade

# errors.activity.title.minLength
source: Activity title must be at least {min} characters long
pt_br: O título da atividade deve ter pelo menos {min} caracteres

# errors.auth.emailAlreadyRegistered
source: Email already registered
pt_br: E-mail já cadastrado

# errors.auth.invalidCredentials
source: Invalid email or password
pt_br: E-mail ou senha inválidos

# errors.expense.amount.invalid
source: Amount must be greater than 0
pt_br: O valor deve ser maior que 0

# errors.expense.forbidden
source: You don't have permission to perform this action
pt_br: Você não tem permissão para realizar esta ação

# errors.expense.notFound
source: Expense not found
pt_br: Despesa não encontrada

# errors.expense.notParticipant
source: You are not a participant of this expense's activity
pt_br: Você não é participante da atividade desta despesa

# errors.expense.participant.notFound
source: Participant not found
pt_br: Participante não encontrado

# errors.expense.participant.notInActivity
source: All participants must be part of the activity
pt_br: Todos os participantes devem fazer parte da atividade

# errors.expense.participants.duplicate
source: Duplicate participants are not allowed
pt_br: Não são permitidos participantes duplicados

# errors.expense.participants.empty
source: At least one participant is required
pt_br: Pelo menos um participante é obrigatório

# errors.expense.payer.notFound
source: Payer not found
pt_br: Pagador não encontrado

# errors.expense.payer.notParticipant
source: Payer must be a participant of the activity
pt_br: O pagador deve ser participante da atividade

# errors.expense.payment.amount.invalid
source: Payment amount must be greater than 0
pt_br: O valor do pagamento deve ser maior que 0

# errors.expense.payment.exceedsDebt
source: Payment amount exceeds the debt amount
pt_br: O valor do pagamento excede o valor da dívida

# errors.expense.title.minLength
source: Expense title must be at least {min} characters long
pt_br: O título da despesa deve ter pelo menos {min} caracteres

# errors.general.invalidRequest
source: Invalid request
pt_br: Requisição inválida

# errors.participant.alreadyInActivity
source: User is already a participant of this activity
pt_br: O usuário já é participante desta atividade

# errors.participant.cannotRemoveSelf
source: You cannot remove yourself from the activity
pt_br: Você não pode remover a si mesmo da atividade

# errors.participant.duplicate
source: Duplicate participant IDs are not allowed
pt_br: IDs de participantes duplicados não são permitidos

# errors.participant.empty
source: At least one participant ID must be provided
pt_br: Pelo menos um ID de participante deve ser fornecido

# errors.participant.notFound
source: Participant not found in this activity
pt_br: Participante não encontrado nesta atividade

# errors.participant.userNotFound
source: User not found
pt_br: Usuário não encontrado

# errors.signin.email.required
source: Email is required
pt_br: O e-mail é obrigatório

# errors.signin.password.required
source: Password is required
pt_br: A senha é obrigatória

# errors.signup.email.invalid
source: Please enter a valid email address
pt_br: Informe um e-mail válido

# errors.signup.name.minLength
source: Name must be at least {min} characters long
pt_br: O nome deve ter pelo menos {min} caracteres

# errors.signup.password.minLength
source: Password must be at least {min} characters long
pt_br: A senha deve ter pelo menos {min} caracteres

# errors.user.notFound
source: User not found
pt_br: Usuário não encontrado

# errors.user.oneOrBothUsersNotFound
source: One or both users not found
pt_br: Um usuário ou ambos não encontrados

# errors.validation.duplicateParticipants
source: Duplicate participants are not allowed
pt_br: Não são permitidos participantes duplicados

# messages.participant.added
source: Successfully added {count} participant(s)
pt_br: Adicionados {count} participante(s) com sucesso

# messages.participant.addedMultiple
source: Successfully added {count} participants
pt_br: Adicionados {count} participantes com sucesso

# messages.participant.addedSingle
source: Participant added successfully
pt_br: Participante adicionado com sucesso

# messages.participant.removed
source: Participant removed successfully
pt_br: Participante removido com sucesso
